# Задача 1: Найдите сумму цифр трехзначного числа.

a = int(input("Введите трехзначное число: "))

a1 = a//100
a2 = (a - a1*100)//10
a3 = (a - a1*100 - a2*10)
print(a1 + a2 + a3)